[{"quote":"Programs must be written for people to read, and only incidentally for machines to execute. ","author":"H. Abelson and G. Sussman (in \"The Structure and Interpretation of Computer Programs)"},{"quote":"The computer revolution is a revolution in the way we think and in the way we express what we think.\nThe essence of this change is the emergence of what might best be called procedural epistemology--the study of the structure of knowledge from an imperative point of view, as opposed to the more declarative point of view taken by classical mathematical subjects.","author":"H. Abelson and G. Sussman (in \"The Structure and Interpretation of Computer Programs)"},{"quote":"We have also obtained a glimpse of another crucial idea about languages and program design.\nThis is the approach of statified design, the notion that a complex system should be structured as a sequence of levels that are described using a sequence of languages.\nEach level is constructed by combining parts that are regarded as primitive at that level, and the parts constructed at each level are used as primitives at the next level.\nThe language used at each level of a stratified design has primitives, means of combination, and means of abstraction appropriate to that level of detail.","author":"H. Abelson and G. Sussman (in \"The Structure and Interpretation of Computer Programs)"},{"quote":"A common mistake people make when trying to design something completely foolproof is to underestimate the ingenuity of complete fools.","author":"D. Adams"},{"quote":"Good teaching is more a giving of the right questions than a giving of the right answers.","author":"J. Albers"},{"quote":"They know enough who know how to learn","author":"J. Adams"},{"quote":"Computer Science is a science of abstraction -creating the right model for a problem and devising the appropriate mechanizable techniques to solve it.","author":"A. Aho and J. Ullman"},{"quote":"Each pattern describes a problem which occurs over and over again in our environment, and then describes the core of the solution to that problem, in such a way that you can use this solution a million times over, without ever doing it in the same way twice.","author":"C. Alexander"},{"quote":"Don't worry about people stealing your ideas.\nIf your ideas are any good, you'll have to ram them down people's throats.","author":"H. Aiken"},{"quote":"Eighty percent of success is showing up.","author":"W. Allen"},{"quote":"If you're not failing every now and again, it's a sign you're not doing anything very innovative.","author":"W. Allen"},{"quote":"More is different.","author":"P. Anderson (attacking the reductionist hypothesis in science, by concluding that quantitatively larger systems can be qualitatively different)"},{"quote":"Today, most software exists, not to solve a problem, but to interface with other software.","author":"I. O. Angell"},{"quote":"All programmers are playwrights and all computers are lousy actors.","author":"Anonymous"},{"quote":"Any programming problem can be solved by adding a level of indirection.\n(also see \"Any performance problem...\" by M. Haertel).","author":"Anonymous"},{"quote":"Bad code isn't bad, its just misunderstood.","author":"Anonymous"},{"quote":"Debugging is anticipated with distaste, performed with reluctance, and bragged about forever.","author":"Anonymous"},{"quote":"Experience is a poor teacher: it gives its tests before it teaches its lessons.","author":"Anonymous"},{"quote":"If I had eight hours to chop down a tree, I would spend 6 hours sharpening an axe.","author":"Anonymous"},{"quote":"If you understand what you're doing, you're not learning anything.","author":"Anonymous"},{"quote":"In theory, there is no difference between theory and practice, but not in practice.","author":"Anonymous"},{"quote":"It is easier to measure something than to understand what you have measured.","author":"Anonymous"},{"quote":"Measure twice, cut once.","author":"Anonymous"},{"quote":"Microsoft, where quality is job 1.1","author":"Anonymous"},{"quote":"On a visit to the NASA space center, President Kennedy spoke to a man sweeping up in one of the buildings.\n\"What's your job here?\" asked Kennedy.\n\"Well Mr. President,\" the janitor replied, \"I'm helping to put a man on the moon\".","author":"Anonymous"},{"quote":"One day a mother comes home from work and asks her son, \"What did you do today?\"\nThe son replied, \"I taught our dog how to play the piano.\"\nThe mother, incredulous, asked, \"Our dog can play the piano?\", to which the son laughed and replied, \"Of course not mom. I said that I taught him; I didn't say that he learned how.\"","author":"Anonymous"},{"quote":"Programming languages should be designed not by piling feature on top of feature, but by removing the weaknesses and restrictions that make additional features appear necessary.","author":"Anonymous, Revised Report on the Algorithmic Language Scheme"},{"quote":"Programs for sale: Fast, Reliable, Cheap: choose two.","author":"Anonymous"},{"quote":"Real programmers don't comment their code.\nIf it was hard to write, it should be hard to understand.","author":"Anonymous"},{"quote":"Recurses! Called again.","author":"Anonymous"},{"quote":"The person who knows HOW will always have a job.\nThe person who knows WHY will always be his/her boss.","author":"Anonymous"},{"quote":"The sooner you get behind in your work, the more time you have to catch up.","author":"Anonymous"},{"quote":"There are only 10 different kinds of people in the world: those who know binary and those who don't.","author":"Anonymous"},{"quote":"Think (design) globally; act (code) locally.","author":"Anonymous"},{"quote":"Think twice, code once.","author":"Anonymous"},{"quote":"Time is an excellent teacher; but eventually it kills all its students.","author":"Anonymous"},{"quote":"Weeks of programming can save you hours of planning.","author":"Anonymous"},{"quote":"When a programming language is created that allows programmers to program in simple English, it will be discovered that programmers cannot speak English.","author":"Anonymous"},{"quote":"Why do we never have time to do it right, but always have time to do it over?","author":"Anonymous"},{"quote":"By viewing the old we learn the new.","author":"Anonymous Chinese Proverb"},{"quote":"Give me a fish and I eat for a day. Teach me to fish and I eat for a lifetime.","author":"Anonymous Chinese Proverb"},{"quote":"He who asks is a fool for five minutes; he who does not ask remains a fool forever.","author":"Anonymous Chinese Proverb"},{"quote":"Teachers open the door, but you must enter by yourself.","author":"Anonymous Chinese Proverb"},{"quote":"Tell me and I forget. Show me and I remember. Involve me and I understand.","author":"Anonymous Chinese Proverb"},{"quote":"The first step towards wisdom is calling things by their right names.","author":"Anonymous Chinese Proverb"},{"quote":"The person who says it cannot be done should not interrupt the person doing it.","author":"Anonymous Chinese Proverb"},{"quote":"He who is ashamed of asking is ashamed of learning.","author":"Anonymous Danish Proverb"},{"quote":"No matter how far down the wrong road you have gone, turn back now.","author":"Anonymous Turkish Proverb"},{"quote":"Those who know, do. Those who understand, teach.","author":"Aristotle"},{"quote":"We are what we repeatedly do.\nExcellence, then, is not an act, but a habit.","author":"Aristotle"},{"quote":"The Analytical Engine weaves Algebraical patterns just as the Jacquard loom weaves flowers and leaves.","author":"A. Augusta, Countess of Lovelace, on Babbage's Analytical Engine"},{"quote":"On two occasions, I have been asked [by members of Parliament], \"Pray,\nMr. Babbage, if you put into the machine wrong figures, will the right answers come out?\"\nI am not able to rightly apprehend the kind of confusion of ideas that could provoke such a question.","author":"C. Babage"},{"quote":"I, myself, have had many failures and I've learned that if you are not\nfailing a lot, you are probably not being as creative as you could be -you aren't stretching your imagination.","author":"J. Backus"},{"quote":"A prudent question is one-half of wisdom.","author":"F. Bacon"},{"quote":"I can only think that the book is read because it deals with the difficulties of schooling, which do not change.\nPlease note: the difficulties, not the problems.\nProblems are solved or disappear with the revolving times.\nDifficulities remain.\nIt will always be difficult to teach well, to learn accurately; to read, write, and count readily and competently; to acquire a sense of history and start one's education or anothers.","author":"J. Barzun (\"Begin Here\", pp 14),"},{"quote":"The American university is built on two false premises: that all teachers must add to the existing stock of knowledge by research, and that all self-respecting institutions fulfill this role only by employing productive scholars...Of course, the teacher must keep reading and thinking abreast of his time, but this does not mean that he must write and publish.\nThe confusion hides a further absurd assumption,  which is that when a man writes a scholarly book that reaches a dozen specialists he adds immeasurably to the world's knowledge; whereas if he imparts his thoughts and his reading to one hundred and fifty students every year, he is wasting his time and leaving the world in darkness.\nOne is tempted to ask what blinkered pedant ever launched the notion that students in coming to college seceded from the human race and may therefore be safely left out when knowledge is being broadcast.","author":"J. Barzun (\"Teacher in America\"),"},{"quote":"Optimism is an occupational hazard of programming: testing is the treatment.","author":"K. Beck"},{"quote":"The cheapest, fastest, and most reliable components of a computer system are those that aren't there.","author":"G. Bell"},{"quote":"Dakin (to Irwin, his teacher): Do you really believe that, sir, or are you just trying to make us think?","author":"A. Bennet (in \"The History Boys\")"},{"quote":"The key to performance is elegance, not batallions of special cases.","author":"J. Bently & D. McIlroy"},{"quote":"Walking on water and developing software from a specification are easy if both are frozen.","author":"E. Berard"},{"quote":"More than the act of testing, the act of designing tests is one of the best bug preventers known.\nThe thinking that must be done to create a useful test can discover and eliminate bugs before they are coded - indeed, test-design thinking can discover and eliminate bugs at every stage in the creation of software, from conception to specification, to design, coding and the rest.","author":"B. Bezier"},{"quote":"There is a division in the student population between those who go to college to learn and those who go to college to earn a diploma.","author":"J. Blau (letter to the editor, Chronicle of Higher Education, May 24, 2002)"},{"quote":"It is wrong to think that the task of physics is to find out how nature is.\nPhysics concerns what we say about nature.","author":"N. Bohr"},{"quote":"Opposites are not contradictory but complementary.","author":"N. Bohr"},{"quote":"Software development has been, is, and will likely remain fundamentally hard.\nBuilding quality systems involves an essential and irreducible complexity, which is why the entire history of software engineering can be characterized as one of rising levels of abstraction.\nAs such, the task of the software development team is to engineer the illusion of simplicity.\nNonetheless, software-intensive systems can amplify human intelligence, but they cannot replace human judgment; software-intensive systems  can fuse, co-ordinate, classify, and analyze information, but they cannot create knowledge.\nIn other words, not everything we want to build can be built: there exist pragmatic theoretical and technical limits that make software develpment hard if not impossible.\nFurthermore, not everything we want to build should be built: there exist moral economic, social, and political limits that govern human industry.\nFrom fundamental to human, these are the factors tht define the limits of software, factors that separate our vision from execution.","author":"G. Booch (in a blurb from a talk, \"The Limits of Software\")"},{"quote":"That language is an instrument of human reason, and not merely a medium for the expression of thought, is a truth generally admitted.","author":"G. Boole"},{"quote":"The greatest obstacle to discovery is not ignorance, but the illusion of knowledge.","author":"D. Boorstin"},{"quote":"The most likely way for the world to be destroyed, most experts agree, is by accident.\nThat's where we come in; we're computer professionals.\nWe cause accidents.","author":"N. Borenstein"},{"quote":"All models are wrong; some models are useful.","author":"G. Box"},{"quote":"Simplicity and flexibility will trump optimization and power in a world where connectivity is the key.","author":"A. Bosworth (paraphrased by David Bank in Breaking Windows, page 203)"},{"quote":"The important thing in science is not so much to obtain new facts as to discover new ways of think about them.","author":"W. Bragg"},{"quote":"Information wants too be free.\nInformation also wants to be expensive.\nInformation wants to be free because it has become so cheap to distribute, copy, and recombine---too cheap to meter.\nIt wants to be expensive because it can be immeasurably valuable to the recipient.\nThat tension will not go away.\nIt leads to endless wrenching debate about price, copyright, \"intellectual property\", the moral rightness of casual distribution, because each round of new devices makes the tension worse, not better.","author":"S. Brand (see the Information Wants to Be Free web page)"},{"quote":"It is important that students bring a certain ragamuffin, barefoot irreverence to their studies; they are not here to worship what is known, but to question it.","author":"J. Bronowski"},{"quote":"That is the essence of science: ask an impertinent question, and you are on the way to a pertinent answer.","author":"J. Bronowski"},{"quote":"Welcome to Yale. \nYale will be for you and to you what you make of it. \nDespite the gloom of the times this is not a gloomy place.\nIt is a place where life can have purpose without being a society of driven men and women.\nIt is also a place where there is no escape from argument, for the next person you meet will not be likely to agree with the last person talked to.\nThis is a community which rewards participation but does not expect conformity.\nThis is primarily a place for learning, but not all learning is in books or laboratories or classrooms. \nYou probably have not been as free before.\nYou may not be as free again.\nEnjoy the privilege of doubt. \nMake the most of it. ","author":"K. Brewster"},{"quote":"Good judgment comes from experience; experience comes from bad judgment.","author":"F. Brooks"},{"quote":"Plan to throw one away; you will anyhow.","author":"F. Brooks (\"The Mythical Man-Month\", Chapter 11)"},{"quote":"If you plan to throw one away, you will throw away two.","author":"C. Zerouni"},{"quote":"Scientists build to learn; Engineers learn to build.","author":"F. Brooks"},{"quote":"The hardest part of the software task is arriving at a complete and consistent specification, and much of the essence of building a program is in fact the debugging of the specification.","author":"F. Brooks"},{"quote":"The programmer, like the poet, works only slightly removed from pure thought-stuff.\nHe builds castles in the air, from air, creating by exertion of the imagination.\nFew media of creation are so flexible, so easy to polish and rework, so readily capable of realizing grand conceptual structures.\nYet the program construct, unlike the poet's words, is real in the sense that it moves and works, producing visible outputs separate from  the construct itself.\nIt prints results, draws pictures, produces sounds, moves arms.\nThe magic of myth and legend has come true in our time.\nOne types the correct incantation on a keyboard, and a display screen comes to life, showing things that never were nor could be.\n...\nThe computer resembles the magic of legend in this respect, too.\nIf one character, one pause, of the incantation is not strictly in proper form, the magic doesn't work.\nHuman beings are not accustomed to being perfect, and few areas of human activity demand it.\nAdjusting to the requirement for perfection is, I think, the most difficult part of learning to program.","author":"F. Brooks (\"The Mythical Man Month\", pages 7-8)"},{"quote":"Successful software always gets changed.","author":"F. Brooks"},{"quote":"A man's reach should exceed his grasp, or what's heaven for? ","author":"R. Browning"},{"quote":"They may forget what you said, but they will never forget how you made them feel.","author":"C. Buchner"},{"quote":"...and then it occurred to me that a computer is a stupid machine with the ability to do incredibly smart things, while computer programmers are smart people with the ability to do incredibly stupid things.\nThey are, in short, a perfect match.","author":"B. Bryson"},{"quote":"Learning how to learn is life's most important skill. ","author":"T. Buzan"},{"quote":"The first 90% of the code accounts for the first 90% of the development time.\nThe remaining 10% of the code accounts for the other 90% of the development time.","author":"T. Cargill"},{"quote":"The sooner you start to code, the longer the program will take.","author":"R. Carlson"},{"quote":"The important point is that the cost of adding a feature isn't just the time it takes to code it.\nThe cost also includes the addition of an obstacle to future expansion.\nSure, any given feature list can be implemented, given enough coding time.\nBut in addition to coming out late, you will usually wind up with a codebase that is so fragile that new ideas that should be dead-simple wind up taking longer and longer to work into the tangled existing web.\nThe trick is to pick the features that don't fight each other.","author":"J. Carmack"},{"quote":"We think too much about effective methods of teaching and not enough about effective methods of learning.\nNo matter how good teaching may be, each student must take the responsibility for his own education.","author":"J. Carolus S.J."},{"quote":"In a way, math isn't the art of answering mathematical questions, it is the art of asking the right questions, the questions that give you insight, the ones that lead you in interesting directions, the ones that connect with lots of other interesting questions -the ones with beautiful answers.","author":"G. Chaitin (pg. 23, in \"Meta Math: The Quest for Omega\")"},{"quote":"Any sufficiently advanced technology is indistinguishable from magic.","author":"A. Clarke"},{"quote":"We don't have time to stop for gas, we're already late.","author":"M. Cleron (Commenting on how Software Projects are often Run)"},{"quote":"Whenever there is a hard job to be done I assign it to a lazy man; he is sure to find an easy way of doing it.","author":"W. Chrysler"},{"quote":"The real technology -behind all our other technologies- is language.\nIt actually creates the world our consciousness lives in.","author":"A. Codrescu"},{"quote":"I hear and I forget; I see and I remember; I do and I understand.","author":"Confucius"},{"quote":"Never hesitate to ask a lesser person.","author":"Confucius"},{"quote":"Press on.\nNothing in th world can take the place of persistence.\nTalent will not; nothing is more common than unsuccessful men with talent.\nGenius will not; unrewarded genius is almost a proverb.\nEducation alone will not; the world is full of educated derelicts.\nPersistence and determination alone are omnipotent.","author":"C. Coolidge"},{"quote":"The value of a prototype is in the education it gives you, not in the code itself.","author":"A. Cooper (in \"The Inmates are Running the Asylum\")"},{"quote":"When the words are fuzzy, the programmers reflexively retreat to the most precise method of articulation available: source code.\nAlthough there is nothing more precise than code, there is also nothing more permanent or resistant to change.\nSo the situation frequently crops up where nomenclature confusion drives programmers to begin coding prematurely, and that code becomes the de facto design, regardless of its appropriateness or correctness.","author":"A. Cooper (in \"The Inmates are Running the Asylum\")"},{"quote":"Doing more things faster is no substitute for doing the right things.","author":"S. R. Covey"},{"quote":"The generation of random numbers is too important to be left to chance.","author":"R. Coveyou"},{"quote":"If you don't think carefully, you might believe that programming is just typing statements in a programming language.","author":"W. Cunningham"},{"quote":"Who dares to teach must never cease to learn.","author":"J.C. Dana"},{"quote":"Every now and then go away, have a little relaxation, for when you come back to your work your judgment will be surer.\nGo some distance away because then the work appears smaller and more of it can be taken in at a glance and a lack of harmony and proportion is more readily seen.","author":"L. Da Vinci"},{"quote":"Simplicity is the ultimate sophistication.","author":"L. Da Vinci"},{"quote":"If you cannot describe what you are doing as a process, you don't know what you're doing.","author":"W. E. Deming"},{"quote":"Question authority; but, raise your hand first.","author":"A. Dershowitz"},{"quote":"One can think effectively only when one is willing to endure suspense and to undergo the trouble of searching.","author":"J. Dewey"},{"quote":"A most important, but also most elusive, aspect of any tool is its influence on the habits of those who train themselves in its use.\nIf the tool is a programming language this influence is, whether we like it or not, an influence on our thinking habits....\nA programming language is a tool that has profound influence on our thinking habits.","author":"E. Dijkstra"},{"quote":"Being abstract is something profoundly different from being vague...\nThe purpose of abstraction is not to be vague, but to create a new semantic level in which one can be absolutely precise.","author":"E. Dijkstra"},{"quote":"Besides a mathematical inclination, an exceptionally good mastery of one's native tongue is the most vital asset of a competent programmer.","author":"E. Dijkstra"},{"quote":"Computer Science is no more about computers than astronomy is about telescopes.","author":"E. Dijkstra"},{"quote":"John von Neumann draws attention to what seemed to him a contrast.\nHe remarked that for simple mechanisms, it is often easier to describe how they work than what they do, while for more complicated mechanisms, it is usually the other way around.","author":"E. Dijkstra (Trip Reports, 213)"},{"quote":"Object-oriented programming is an exceptionally bad idea which could only have originated in California","author":"E. Dijkstra (note: OOP originated in Norway, quite near Holland -Dijkstra's home)"},{"quote":"...our intellectual powers are rather geared to master static relations and that our powers to visualize processes evolving in time are relatively poorly developed.\nFor that reason we should do (as wise programmers aware of our limitations) our utmost to shorten the conceptual gap between the static program and the dynamic process, to make the correspondence between the program (spread out in text space) and the process (spread out in time) as trivial as possible.","author":"E. Dijkstra (in \"Goto Considered Harmful\")"},{"quote":"Progress is possible only if we train ourselves to think about programs without thinking of them as pieces of executable code. ","author":"E. Dijkstra"},{"quote":"Simplicity is prerequisite for reliability.","author":"E. Dijkstra"},{"quote":"...Simplifications have had a much greater long-range scientific impact than individual feats of ingenuity.\nThe opportunity for simplification is very encouraging, because in all examples that come to mind the simple and elegant systems tend to be easier and faster to design and get right, more efficient in execution, and much more reliable than the more contrived contraptions that have to be debugged into some degree of acceptability....Simplicity and elegance are unpopular because they require hard work and discipline to achieve and education to be appreciated.","author":"E. Dijkstra (The Tide, not the waves; in Denning/Metcalfe: Beyond Calculation, Springer-Verlag 1997)"},{"quote":"The tools we use have a profound (and devious!) influence on our thinking habits, and, therefore, on our thinking abilities.","author":"E. Dijkstra"},{"quote":"Testing can show the presence of errors, but not their absence.","author":"E. Dijkstra"},{"quote":"The competent programmer is fully aware of the strictly limited size of his own skull; therefore he approaches the programming task in full humility, and among other things he avoids clever tricks like the plague.","author":"E. Dijkstra (in \"The Humble Programmer\", his 1972 Turing Award Lecture)"},{"quote":"The art of programming is the arto of organizaing complexity, of mastering multitude and avoiding its bastard chaos.","author":"E. Dijkstra (in \"Notes on Structured Programmin\")"},{"quote":"We are all shaped by the tools we use, in particular: the formalisms we use shape our thinking habits, for better or for worse, and that means that we have to be very careful in the choice of what we learn and teach, for unlearning is not really possible.","author":"E. Dijkstra (in Answers to Questions from Students of Sofware Engineering)"},{"quote":"Yes, I share your concern: how to program well -though a teachable topic- is hardly taught.\nThe situation is similar to that in mathematics, where the explicit curriculum is confined to mathematical results; how to do mathematics is something the student must absorb by osmosis, so to speak.\nOne reason for preferring symbol-manipulating, calculating arguments is that their design is much better teachable than the design of verbal/pictorial arguments.\nLarge-scale introduction of courses on such calculational methodology, however, would encounter unsurmoutable political problems. ","author":"E. Dijkstra (in Answers to Questions from Students of Sofware Engineering)"},{"quote":"Text is linear; it is black and white; it doesn't zoom around the page in 3-D; it isn't intelligent by itself; in fact, in terms of immediate reaction it is quite boring.\nI can't imagine a single preliterate was ever wowed at the first sight of text, and yet text has been the basis of arguably the most fundamental intellectual transformation of the human species.\nIt and its subforms, such as algebra, have made science education for all a plausible goal.","author":"A.diSessa (\"Changing Minds: Computers, Learning, and Literacy\", MIT Press, 2000; page 112)"},{"quote":"There is nothing so useless as doing efficiently that which should not be  done at all.","author":"P. Drucker"},{"quote":"The first step in fixing a broken program is getting it to fail repeatably [on the simplest example possible]. ","author":"T. Duff"},{"quote":"It's supposed to be hard!\nIf it wasn't hard, everyone would do it.\nThe hard... is what makes it great!\"","author":"J. Dugan (said by Tom Hanks' character in \"A League of Their Own\" in response to a complaint from one of his ball players)"},{"quote":"Genius is 1 percent inspiration and 99 percent perspiration.\nAs a result, genius is often a talented person who has simply done all of his homework.","author":"T. Edison"},{"quote":"Any intelligent fool can make things bigger, more complex, and more violent.\nIt takes a touch of genius - and a lot of courage - to move in the opposite direction.","author":"A. Einstein"},{"quote":"Everything should be made as simple as possible, but not simpler.","author":"A. Einstein"},{"quote":"Example isn't another way to teach.\nIt is the only way to teach.","author":"A. Einstein"},{"quote":"If you can't explain it simply, you don't understand it well enough.","author":"A. Einstein"},{"quote":"Imagination is more important than knowledge.","author":"A. Einstein"},{"quote":"Out of clutter, find simplicity.\nFrom discord, find harmony.\nIn the middle of difficulty, lies opportunity.","author":"A. Einstein"},{"quote":"Reinventing the wheel is a process.","author":"R. Elisha"},{"quote":"To arrive at the simple is difficult.","author":"R. Elisha"},{"quote":"Shall I tell you the secret of the true scholar?\nIt is this: every man I meet is my master in some point, and in that I learn of him.","author":"R.W. Emerson"},{"quote":"The proof of a high education is the ability to speak about complex matters as simply as possible.","author":"R.W. Emerson"},{"quote":"The structure of a system reflects the structure of the organization that built it.","author":"R. Fairley"},{"quote":"In those days [batch processing] programmers never even documented their programs, because it was assumed that nobody else would ever use them.\nNow, however, time-sharing had made exchanging software trivial: you just stored one copy in the public repository and therby effectively gave it to the world. \nImmediately people began to document their programs and to think of them as being usable by others.\nThey started to build on each other's work.","author":"R. Fano (in Waldrop, \"The Dream Machine\", pp. 232)"},{"quote":"I can live with doubt and uncertainty.\nI think it's much more intersting to live not knowing than to have answers which might be wrong...\nIn physics the truth is rarely perfectly clear, and that is certainly universally the case in human affairs.\nHence, what is not surrounded by uncertaintly cannot be the truth.","author":"R. Feynman (in \"Perfectly Reasonable Deviations from the Beaten Track: The Letters of Richard P. Feynman\")"},{"quote":"Precise language is not the problem.\nClear language is the problem.","author":"R. Feynman"},{"quote":"The inside of a computer is as dumb as hell but it goes like mad!","author":"R. Feynman"},{"quote":"What I cannot create I do not understand.","author":"R. Feynman"},{"quote":"When the problem [quantum chromodynamics] is finally solved, it will all be by imagination.\nThen there will be some big thing about the great way it was done.\nBut it's simple -it will all be by imagination, and persistence.","author":"R. Feynman (in Mlodinow's \"Feynman's Rainbow\")"},{"quote":"When a Caltech student asked the eminent cosmologist Michael Turner what his \"bias\" was in favoring one or another particle as a likely candidate to compromise dark matter in the universe, Feynmann snapped, \"Why do you want to know his bias? Form your own bias!\"","author":"R. Feynman (related by Timothy Ferris in \"Perfectly Reasonable Deviations from the Beaten Track: The Letters of Richard P. Feynman\")"},{"quote":"There does not now, nor will there ever exist, a programming language in which it is the least bit hard to write bad programs.","author":"L. Flon"},{"quote":"An engineer can do for a nickel what any damn fool can do for a dollar.","author":"H. Ford"},{"quote":"Education's purpose is to replace an empty mind with an open one.","author":"M. Forbes"},{"quote":"Any fool can write code that a computer can understand.\nGood programmers write code that humans can understand. ","author":"M. Fowler, \"Refactoring: Improving the Design of Existing Code\""},{"quote":"[Describing JUnit]\nNever in the field of program testing, was so much owed by so many to so few lines of code.","author":"M. Fowler (apologizing to Winston Churchill)"},{"quote":"Awaken people's curiosity.\nIt is enough to open minds, do not overload them.\nPut there just a spark.","author":"A. France"},{"quote":"Simplicity is the soul of efficiency. ","author":"A. Freeman (in The Eye of Osiris)"},{"quote":"When I am working on a problem, I never think about beauty.\nI think only of how to solve the problem.\nBut when I have finished, if the solution is not beautiful, I know it is wrong. ","author":"B. Fuller"},{"quote":"The biggest difference between time and space is that you can't reuse time.","author":"M. Furst"},{"quote":"Habitability is the characteristic of source code that enables programmers\ncoming to the code later in its life to understand its construction and\nintentions and to change it comfortably and confidently... Software needs\nto be habitable because it always has to change...Programs are written and\nmaintained, bugs are fixed, features are added, performance is tuned, and\na whole variety of changes are made both by the original and new programming\nteam members... What is important is that it be easy for programmers\nto come up to speed with the code, to be able to navigate through it\neffectively, to be able to understand what changes to make, and to be able to\nmake them safely and correctly.","author":"R. Gabriel (Patterns of Software, Oxford Press 1996)"},{"quote":"All truths are easy to understand once they are discovered; the point is to discover them.","author":"G. Galilie"},{"quote":"A complex system that works in invariably found to have evolved from a simple system that worked.","author":"J. Gall"},{"quote":"An excellent plumber is infinitely more admirable than an incompetent philosopher.\nThe society that scorns excellence in plumbing because plumbing is a humble activity and tolerates shoddiness in philosophy because it is exalted activity will have neither good plumbing or good philosophy.\nNeither its pipes or its theories will hold water.","author":"J. Gardner"},{"quote":" 640K [of main memory] ought to be enough for anybody.","author":"W. Gates (Founder and CEO Microsoft), 1981 - disclaimed"},{"quote":"A great lathe operator commands several times the wage of an average lathe operator, but a great writer of software code is worth 10,000 times the price of an average software writer.","author":"W. Gates"},{"quote":"The best way to prepare [to be a programmer] is to write programs, and to study great programs that other people have written.\nIn my case, I went to the garbage cans at the Computer Science Center and fished out listings of their operating systems.","author":"W. Gates"},{"quote":" We flew down weekly to meet with IBM, but they thought the way to measure software was the amount of code we wrote, when really the better the software, the fewer lines of code.","author":"W. Gates"},{"quote":"It is not knowledge, but the act of learning, not possession, but the act of getting there which generates the greatest satisfaction.","author":"F. Gauss"},{"quote":"Beauty is more important in computing than anywhere else in technology because software is so complicated.\nBeauty is the ultimate defense against complexity.\n...\nThe geniuses of the computer field, on the the other hand, are the people with the keenest aesthetic senses, the ones who are  capable of creating beauty.\nBeauty is decisive at every level: the most important interfaces, the most important programming languages, the winning algorithms are the beautiful ones.","author":"D. Gelernter (\"Machine Beauty\", Basic Books, 1998)"},{"quote":"Good programmers know what's beautiful and bad ones don't.","author":"D. Gelernter (\"Machine Beauty\", Basic Books, 1998)"},{"quote":"Object-oriented programming as it emerged in Simula 67 allows software structure to be based on real-world structures, and gives programmers a powerful way to simplify the design and construction of complex programs.","author":"D. Gelernter (\"Machine Beauty\", Basic Books, 1998)"},{"quote":"One of the principal objects of theoretical research in any department of knowledge is to find the point of view from which the subject appears in its greatest simplicity.","author":"J. W. Gibbs"},{"quote":"Vague and nebulous is the beginning of all things, but not their end.","author":"K. Gibran"},{"quote":"At the source of every error which is blamed on the computer, you will find at least two human errors, one of which is the error of blaming it on the computer.","author":"T. Gilb (in \"Laws of Unreliability\", Datamation March 1975)"},{"quote":"Indirection is the right direction.","author":"A. Glew"},{"quote":"Never put off until run time what can be done at compile time.","author":"A. Glew"},{"quote":"Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live.","author":"M. Golding"},{"quote":"A really good language should be both clean and dirty: cleanly designed, with a small core of well understood and highly orthogonal operators, but dirty in the sense that it lets hackers have their way with it....A real hacker's language will always have a slightly raffish character.","author":"P. Graham (in \"Hackers and Painters\" pg. 204)"},{"quote":"Great software, likewise, requires a fanatical devotion to beauty.\nIf you look inside good software, you find that parts that no one is ever supposed to see are beautiful too.\nWhen it comes to code I behave in a way that would make me eligible for prescription drugs if I approached everyday life the same way.\nIt drives me crazy to see code that's badly indented, or that uses ugly variable names.","author":"P. Graham (in \"Hackers and Painters\" pg. 29)"},{"quote":"Imagine the kind of conversation you would have with someone so far away that there was a transmission delay of one minute.\nNow imagine speaking to someone in the next room.\nYou wouldn't just have the same conversation faster, you would have a different kind of conversation.\nIn Lisp, developing software is like speaking face-to-face.\nYou can test code as you're writing it.\nAnd instant turnaround has just as dramatic an effect on development as it does on conversation.\nYou don't just write the same program faster; you write a different kind of program. ","author":"P. Graham (in \"On Lisp\")"},{"quote":"The difference between design and research seems to be a question of the good versus the new.\nDesign doesn't have to be new, but it has to be good.\nResearch doesn't have to be good, but it has to be new.\nI think these two paths converge at the top: the best design surpasses its predecessors by using new ideas, and the best research solves problems that are not only new, but worth solving.\nSo ultimately design and research are aiming for the same destination, just approaching it from different directions.","author":"P. Graham (in \"Hackers and Painters\" footnote 9, pg. 224)"},{"quote":"The way to make programs easy to read is not to stuff them with comments...\nA good programming language ought to be better for explaining software than English.\nYou should only need comments when there is some kind of kludge you need to warn readers about, just as on a road there are only arrows on parts with unexpectedly sharp curves.","author":"P. Graham (in \"Hackers and Painters\" footnote 9, pg. 224)"},{"quote":"Incidentally, when we're faced with a \"prove or disprove,\" we're usually better off trying first to disprove with a counterexample, for two reasons:\nA disproof is potentially easier (we need just one counterexample); and nitpicking arouses our creative juices.\nEven if the given assertion is true, our search for a counterexample often leads to a proof, as soon as we see why a counterexample is impossible.\nBesides, it's healthy to be skeptical. ","author":"R. Graham, D. Knuth and O. Patashnik (in \"Concrete Mathematics: A Foundation for Computer Science\")"},{"quote":"Any sufficiently complicated C or Fortran program contains an ad hoc informally specified bug-ridden slow implementation of half of Lisp.","author":"P. Greenspun"},{"quote":"UNIX was not designed to stop people from doing stupid things, because that would also stop them from doing clever things.","author":"D. Gwyn"},{"quote":"Any performance problem can be solved by removing a level of indirection. (also see \"Any programming problem...\" by Anonymous).","author":"M. Haertel"},{"quote":"The tendency to err that programmers have been noticed to share with other human beings has often been treated as though it were an awkwardness attendant upon programing's adolescence, which like acne would disappear with the craft's coming of age.\nIt has proved otherwise.","author":"M. Halpern"},{"quote":"The purpose of computing is insight, not numbers.","author":"R. Hamming"},{"quote":"","author":"F. Hapgood"},{"quote":"The mathematician's patterns, like those of the painter's or the poet's, the ideas, like the colours or words, must fit together in a harmonious way.\nThere is no permanent place in this world for ugly mathematics.","author":"G.H. Hardy (in \"A Mathematician's Apology\")"},{"quote":"Programming is an explanatory activity.","author":"R. Harper"},{"quote":"It is very interesting to me how quickly the class has divided up into three factions.\nOne faction being the students who sit in the back of the class, given up sitting in their assigned seats, preparing the cases.\nWhat is it, only October?\nThey've already given up trying -the cowards.\nThe second group are the ones who won't raise their hands or volunteer an answer, but will try when they're called upon.\nThat's where I am right now, living in a state of constant fear.\nAnd then there's the third echelon: the upper echelon; the volunteers.\nThey raise their hands in class.\nThey thrust themselves into the fray.\nI don't think they're smarter than anyone else, but they have courage.\nAnd, they'll achieve the final recognition, that teachers will get to know their names, and they'll get better grades.\nThe past couple weeks I've been preparing to enter the upper echelon, and this weekend -if I can get all my work done- I'm going to enter it Monday morning, in Kingsfield's contract law class.","author":"James Hart (a law student in \"The Paper Chase\")"},{"quote":"[Breaking into the \"red\" room in the Harvard law library, which contains the notes of Harvard professors from their school days, and drafts of their articles and books]\nDo you realize what this is?\nThis is it.\nThis is the unbroken chain.\nThe ageless passing of wisdom.\nHey [what is it?] listen to this. \"Kingsfield, Charles W. notes on contract lawy in the course on contracts by Professor Williston at the Harvard Law School, 1927\".\nWhat the hell is it.\nThey're just notes: and they look just like mine.\nLook [reading from Kingsfield's notes]. \"Questions: Does everybody have a contract to obey everybody else's rights. What is a contract? What do you owe to others?\"\nLook, there are even doodles.\n[C'mon, let's get outta here.]\nWait, wait. \"Can we make a contract with G-d that is biding to man? ... After all, I am almost the living extension of the old judges. Where would they be without me. I carry in my mind the cases they wrote. Where the hell woudl they be if it wasn't for me? Who would hang their pictures if there were no law students? It's hard being the living extension of tradition.\"","author":"James Hart (a law student in \"The Paper Chase\")"},{"quote":"There are features that should not be used.\nThere are concepts that should not be exploited.\nThere are problems that should not be solved.\nThere are programs that should not be written.","author":"R. Harter"},{"quote":"The one who insists on never uttering an error must remain silent.","author":"W. Heisenberg"},{"quote":"The speed of a non-working program is irrelevant.","author":"S. Heller (in \"Efficient C/C++ Programming\")"},{"quote":"Refactoring provides enough energy to a system for it to relax into a new and more comfortable state, a new local minimum.\nThe effect of refactoring commonality is to tame the complexity of your system.","author":"K. Henney (in Minimalism: The Imperial Clothing Crisis)"},{"quote":"A process cannot be understood by stopping it.\nUnderstanding must move with the flow of the process, must join and flow with it.","author":"F. Herbert (The First Law of Mentat in \"Dune\")"},{"quote":"It's [programming] the only job I can think of where I get to be both an engineer and an artist.\nThere's an incredible, rigorous, technical element to it, which I like because you have to do very precise thinking.\nOn the other hand, it has a wildly creative side where the boundaries of imagination are the only real limitation.","author":"A. Hertzfeld (original Mac programmer)"},{"quote":"...At first I hoped that such a technically unsound project would collapse but I soon realized it was doomed to success.\nAlmost anything in software can be implemented, sold, and even used given enough determination.\nThere is nothing a mere scientist can say that will stand against the flood of a hundred million dollars.\nBut there is one quality that cannot be purchased in this way -and that is reliability.\nThe price of reliability is the pursuit of the utmost simplicity.\nIt is a price which the very rich find most hard to pay.","author":"C.A.R. Hoare"},{"quote":"I was eventually persuaded of the need to design programming notations so as to maximize the number of errors which cannot be made, or if made, can be reliably detected at compile time.","author":"C.A.R. Hoare"},{"quote":"In the development of the understanding of complex phenomena, the most powerful tool available to the human intellect is abstraction.\nAbstraction arises from the recognition of similarities between certain objects, situations, or processes in the real world and the decision to concentrate on these similarities and to ignore, for the time being, their differences.","author":"C.A.R. Hoare"},{"quote":"Inside every well-written large program is a well-written small program.","author":"C.A.R. Hoare"},{"quote":"Premature optimization is the root of all evil in programming.","author":"C.A.R. Hoare"},{"quote":"The unavoidable price of reliability is simplicity.","author":"C.A.R. Hoare"},{"quote":"There are two ways of constructing a software design.\nOne way is to make it so simple that there are obviously no deficiencies.\nAnd the other way is to make it so complicated that there are no obvious deficiencies.","author":"C.A.R. Hoare"},{"quote":"What is the central core of the subject [computer science]?\nWhat is it that distinguishes it from the separate subjects with which it is related?\nWhat is the linking thread which gathers these disparate branches into a single discipline.\nMy answer to these questions is simple -it is the art of programming a computer.\nIt is the art of designing efficient and elegant methods of getting a computer to solve problems, theoretical or practical, small or large, simple or complex.\nIt is the art of translating this design into an effective and accurate computer program.","author":"C.A.R. Hoare"},{"quote":"You cannot teach beginners top-down programming, because they don't know which end is up.","author":"C.A.R. Hoare"},{"quote":"All thought is a kind of computation.","author":"D. Hobbes"},{"quote":"The problem is never how to get new, innovative thoughts into your mind, but how to get old ones out!","author":"D. Hock (founder of VISA)"},{"quote":"Using a language we may create models of phenomena of interest, and by using models, phenomena may be studied for purposes of understanding or prediction.\nModels may be used for analysis focussed on a close examination of individual parts of the model and for synthesis aimed at understanding the interplay of the parts, that is, understanding the model as a whole.\nA novel is like a model of the real world expressed in a written languagee like English.\nIn a novel, the characters may be analyzed and the interaction between people may be displayed and studied. (in \"Dreams of Calculus: Perspectives on Mathematics Education\")","author":"J. Hoffman, C. Johnson, A. Logg"},{"quote":"The ability to simplify means to eliminate the unnecessary so that the necessary may speak.","author":"H. Hofmann (in \"Introduction to the Bootstrap\")"},{"quote":"This sequence [of languages, SP/1 through SP/8] solves one of the perennial problems of introductory programming.\nAs J.J. Horning once put it, the subject requires that everything must be taught first.","author":"R. Holt, D. Wortman, D. Barnard and J. Cordy (quoting J.J. Horning) in \"SP/k: A System for Teaching Computer Programming\", CACM 20/5 (May 77) pg. 303"},{"quote":"A ship in port is safe, but that is not what ships are built for.\nI want all the youngsters to sail out to sea and be good ships.","author":"G. Hopper"},{"quote":"When you have a good idea and you've tried it and you know it's going to work, go ahead and do it -because it's much easier to apologize afterwards than it is to get permission.","author":"G. Hopper"},{"quote":"Computer Science is the only discipline in which we view adding a new wing to a building as being maintenance.","author":"J. Horning"},{"quote":"To treat programming scientifically, it must be possible to specify the required properties of programs precisely. Formality is certainly not an end in itself.\nThe importance of formal specifications must ultimately rest in their utility -in whether or not they are used to improve the quality of software or to reduce the cost of producing and maintaining software.","author":"J. Horning"},{"quote":"One purpose of CRC cards [a design tool] is to fail early, to fail often, and to fail inexpensively.\nIt is a lot cheaper to tear up a bunch of cards that it would be to reorganize a large amount of source code.","author":"C. Horstmann (in Object-Oriented Design with Java)"},{"quote":"We [teachers] make the road, others will make the journey.","author":"V. Hugo"},{"quote":"The greatest mistake you can make is to be continually fearing you will make one.","author":"E. Hubbard"},{"quote":"In the practical use of our intellect, forgetting is as important as remembering.","author":"W. James"},{"quote":"That simplicity is the ultimate sophistication.\nWhat we meant by that was when you start looking at a problem and it seems really simple with all these simple solutions, you don't really understand the complexity of the problem.\nAnd your solutions are way too oversimplified, and they don't work.\nThen you get into the problem, and you see it's really complicated.\nAnd you come up with all these convoluted solutions.\nThat's sort of the middle, and that's where most people stop, and the solutions tend to work for a while.\nBut the really great person will keep on going and find, sort of, the key, underlying principle of the problem.\nAnd come up with a beautiful elegant solution that works.","author":"S. Jobs (in \"The Perfect Thing\" by Steven Levy, pg. 67-68)"},{"quote":"The only problem with Microsoft is they just have no taste.\nThey have absolutely no taste.\nWhat that means is -I don't mean that in a small way; I mean that in a big way- is the sense that they don't think of original ideas.\nThey don't bring much culture into their product. ...\nSo I guess I am saddened not by Microsoft's success -I have no problem with their success; they've earned their success (for the most part).\nI have a problem with the fact that the just make really third-rate products.","author":"S. Jobs (transcribed from \"Triumph of the Nerds\")"},{"quote":"Before software can be reusable it first has to be usable.","author":"R. Johnson"},{"quote":"The fastest algorithm can frequently be replaced by one that is almost as fast and much easier to understand.","author":"D. Jones"},{"quote":"To teach is to learn twice.","author":"J. Joubert"},{"quote":"The honest truth is that having a lot of people staring at the code does not find the really nasty bugs. The really nasty bugs are found by a couple of really smart people who just kill themselves. \n(also see \"Given enough eyeballs...\" by E. Raymond).","author":"B. Joy"},{"quote":"In the particular is contained the universal.","author":"J. Joyce"},{"quote":"Mistakes are the portals of discovery.","author":"J. Joyce"},{"quote":"90% of code written today is getting around other people's mistakes.","author":"A. Kay"},{"quote":"Computers are to computing as instruments are to music.\nSoftware is the score whose interpretations amplifies our reach and lifts our spirits.\nLeonardo da Vinci called music the shaping of the invisible, and his phrase is even more apt as a description of software.","author":"A. Kay"},{"quote":"[In a programming language] Simple things should be simple and complex things should be possible. ","author":"A. Kay"},{"quote":"The best way to predict the future is to invent it.","author":"A. Kay"},{"quote":"Until real software engineering is developed, the next best practice is to develop with a dynamic system that has extreme late binding in all aspects.","author":"A. Kay"},{"quote":"When you can measure what you are speaking about, and express it in  numbers, you know something about it; but when you cannot measure it, when you cannot express it in numbers, your knowled is of a meager and unsatisfactory kind.","author":"Lord Kelvin"},{"quote":"Should array indices start at 0 or 1?\nMy compromise of 0.5 was rejected without, I thought, proper consideration.","author":"S. Kelly-Bootle"},{"quote":"If you have a large number of unrelated ideas, you have to get quite a distance away from them to get a view of all of them, and this is the role of abstraction.\nIf you look at each too closely you see too many details.\nIf you get far away things may appear simpler because you can only see the large, broad outlines; you do not get lost in petty details.","author":"J. Kemeny (co-creator of the BASIC programming language)"},{"quote":"Act in haste and repent at leisure; code too soon and debug forever. ","author":"R. Kennington"},{"quote":"Controlling complexity is the essence of computer programming.","author":"B. Kernighan"},{"quote":"Everyone knows that debugging is twice as hard as writing a program in the first place.\nSo if you are as clever as you can be when you write it, how will you ever debug it?","author":"B. Kernighan"},{"quote":"Another effective [debugging] technique is to explain your code to someone else.\nThis will often cause you to explain the bug to yourself.\nSometimes it takes no more than a few sentences, followed by an embarrassed \"Never mind, I see what's wrong. Sorry to bother you.\"\nThis works remarkably well; you can even use non-programmers as listeners.\nOne university computer center kept a teddy bear near the help desk.\nStudents with mysterious bugs were required to explain them to the bear before they could speak to a human counselor. ","author":"B. Kernighan & D. Pike (in \"The Practice of Programming\" pp. 123)"},{"quote":"The only way to learn a new programming language is by writing programs in it.","author":"B. Kernighan & D. Ritchie"},{"quote":"The study of law is something new and unfamiliar to most of you -unlike any schooling you have ever been through before.\nWe use the Socratic method here:\nI call on you, ask you a question, and you answer it.\nWhy don't I just give you a lecture?\nBecause through my questions you learn to teach yourselves.\nThrough this method of questioning-answering, questioning-answering, we seek to develop in you the ability to analyze that vast complex of facts that constitute the relationships of members within a given society.\n\nQuestioning and answering.\nAt times, you may feel that you have found the correct answer.\nI assure you that this is a total delusion on your part.\nYou will never find the correct, absolute, and final answer.\nIn my classroom, there is always another question, another question to follow your answer.\nYes, you are on a treadmill.\nMy little questions spin the tumblers of your mind.\nYou are on an operating table; my little questions are the fingers probing your brain.\nWe do brain surgery here.\nYou teach yourselves the law, but I train your mind.\nYou come in here with a skull full of mush, and you leave thinking like a lawyer.","author":"Professor Kingsfield (addressing 1st year Harvard Law Students in \"The Paper Chase\")"},{"quote":"A charlatan makes obscure what is clear; a thinker makes clear what is obscure.","author":"H. Kingsmill"},{"quote":"Beware of bugs in the above code; I have only proved it correct, not tried it. ","author":"D. Knuth"},{"quote":"Computers are good at following instructions, but not at reading your mind.","author":"D. Knuth (Tex, pg. 9)"},{"quote":"Let us change our traditional attitude to the construction of programs.\nInstead of imagining that our main task is to instruct a computer what to do, let us concentrate rather on explaining to human beings what we want a computer to do. ","author":"D. Knuth"},{"quote":"...One of the most important lessons, perhaps, is the fact that SOFTWARE IS HARD.\nFrom now on I shall have significantly greater respect for every successful software tool that I encounter.\nDuring the past decade I was surprised to learn that the writing of programs for TeX and Metafont proved to be much more difficult than all the other things I had done (like proving theorems or writing books).\nThe creation of good software demand a significiantly higher standard of accuracy than those other things do, and it requires a longer attention span than other intellectual tasks.","author":"D. Knuth (in \"Selected Papers on Computer Science\", pp 161)"},{"quote":"We should forget about small efficiencies, say about 97% of the time: premature optimization is the root of all evil.","author":"D. Knuth"},{"quote":"When certain concepts of TeX are introduced informally, general rules will be stated; afterwards you will find that the rules aren't strictly true.\nIn general, the later chapters contain more reliable information than the earlier ones do.\nThe author feels that this technique of deliberate lying will actually make it easier for you to learn the ideas.\nOnce you understand a simple but false rule, it will not be hard to supplement that rule with its exceptions.","author":"D. Knuth (Tex, pg. vi)"},{"quote":"If we really understand the problem, the answer will come out of it, because the answer is not separate from the problem.","author":"J. Krishnamurti"},{"quote":"There is a race between the increasing complexity of the systems we build and our ability to develop intellectual tools for understanding their complexity.\nIf the race is won by our tools, then systems will eventually become easier to use and more reliable.\nIf not, they will continue to become harder to use and less reliable for all but a relatively small set of common tasks.\nGiven how hard thinking is, if those intellectual tools are to succeed, they will have to substitute calculation for thought.","author":"L. Lamport"},{"quote":"We think only through the medium of words.\nLanguages are true analytical methods.\nAlgebra, which is adapted to its purpose in every species of expression, in the most simple, most exact, and best manner possible, is at the same time a language and an analytical method.\nThe art of reasoning is nothing more than a language well arranged.","author":"A. Lavoisier"},{"quote":"We don't have much time, so we don't teach them; we acquaint them with things that they can learn.","author":"C. Leiserson (on \"The Undergraduate Practicum\" at MIT, from a talk at CMU)"},{"quote":"Learning is never done without errors and defeat.","author":"V. Lenin"},{"quote":"If you want truly to understand something, try to change it.","author":"K. Lewin"},{"quote":"A vivid confirmation of this analysis [the importance of extra-curricular activities] occurred during a lunchtime conversation I had with three computer science graduates of the classes of 1994/1995 who started a company together and sold it in 1998 for more than $250 million.\nOver sandwiches I asked them what part of their computer science education had been most important to the success of their software enterprise.\nAfter a moment of tight smiles and awkward silence, one of the young graduates spoke up.\n\"The computer science courses I took were really terrific,\" he said in an attempt to reassure me, \"but I didn't learn much that I could not have learned on my own.\nThe most important things I learned were from managing the Quincy House Grill.\"\nIt made perfect sense -hiring, firing, and inspiring colleagues, working under pressure in close quarters- all were very much the same in the cheeseburger-flipping business he had run at Harvard as in the software business the three had started in a tiny apartment.","author":"H. Lewis (in \"Excellence Without Soul\", pg. 88)"},{"quote":"...fielding statistics made sense only as numbers, not as language.\nLanguage, not numbers, is what interested him [Bill James, a baseball writer].\nWords, and the meaning they were designed to convey.\n\"When the numbers acquire the significance of the language,\" he later wrote, \"they acquire the power to do all the things which language can do: to become fiction and drama and poetry.\"","author":"M. Lewis (in Moneyball: The Art of Winning an Unfair Game, page 67)"},{"quote":"Complexity is a sign of technical immaturity.\nSimplicity of use is the real sign of a well design product whether it is an ATM or a Patriot missile.","author":"D. Ling"},{"quote":"Composing computer programs to solve scientific problems is like writing poetry.\nYou must choose every word with care and link it with the other words in perfect syntax.\nThere is no place for verbosity or carelessness.\nTo become fluent in a computer lnaguage demands almost the antithesis of modern loose thinking.\nIt requires many interactive sessions, the hands-on use of the device. \nYou do not learn a foreign language from a book, rather you have to live in the country for year to let the langauge become an automatic part of you, and the same is true for computer languages.\n","author":"James Lovelock (Originator of the Gaia Theory)"},{"quote":"In the beginning we must simplify the subject, thus unavoidably falsifying it, and later we must sophisticate away the falsely simple beginning.","author":"M. Maimonides"},{"quote":"Development is maintenance.","author":"B. Marick"},{"quote":"A teacher's job is to take a bunch of live wires and see that they are well-grounded.","author":"D. Martin"},{"quote":"If our designs are failing due to the constant rain of changing requirements, it is our designs that are at fault.\nWe must somehow find a way to make our designs resilient to such changes and protect them from rotting.","author":"R. Martin"},{"quote":"If the only tool you have is a hammer, you tend to see every problem as a nail.","author":"A. Maslow"},{"quote":"Any clod can have the facts; having opinions is an art.","author":"C. McCabe"},{"quote":"Good code is its own best documentation.\nAs you're about to add a comment, ask yourself, \"How can I improve the code so that this comment isn't needed?\"\nImprove the code and then document it to make it even clearer.","author":"S. McConnell"},{"quote":"It's hard enough to find an error in your code when you're looking for it; it's even harder when you've assumed your code is error-free.","author":"S. McConnell"},{"quote":"It's OK to figure out murder mysteries, but you shouldn't need to figure out code.\nYou should be able to read it.","author":"S. McConnell"},{"quote":"Testing by itself does not improve software quality.\nTest results are an indicator of quality, but in and of themselves, they don't improve it.\nTrying to improve software quality by increasing the amount of testing is like try to lose weight by weighing yourself more often.\nWhat you eat before you step onto the scale determines how much you will weigh, and the software development techniques you use determine how many errors testing will find.\nIf you want to lose weight, don't buy a new scale; change your diet.\nIf you want to improve your software, don't test more; develop better.","author":"S. McConnell"},{"quote":"Formal methods will never have a significant impact until they can be used by people who don't understand them.","author":"T. Melham"},{"quote":"Programming is similar to a game of golf.\nThe point is not getting the ball in the hole but how many strokes it takes.","author":"H. Mills"},{"quote":"The only way for errors to occur in a program is by being put there by the author.\nNo other mechanisms are known.\nPrograms can't acquire bugs by sitting around with other buggy programs.\nRight practice aims at preventing insertion of errors and, failing that, removing them before testing or any other running of the program.","author":"H. Mills"},{"quote":"Making the simple complicated is commonplace; making the complicated simple, awesomely simple, that's creativity.","author":"C. Mingus"},{"quote":"A computer is like a violin.\nYou can imagine a novice trying first a phonograph and then a violin.\nThe latter, he says, sounds terrible.\nThat is the argument we have heard from our humanists and most of our computer scientists.\nComputer programs are good, they say, for particular purposes, but they aren't flexible.\nNeither is a violin, or a typewriter, until you learn how to use it.","author":"M. Minsky (in \"Why Programming Is a Good Medium for Expressing Poorly-Understood and Sloppily-Formulated Ideas\")"},{"quote":"Language designers are not intellectuals.\nThey're not as interested in thinking as you might hope.\nThey just want to get a language done and start using it.","author":"D. Moon"},{"quote":"He who hasn't hacked assembly langauge as a youth has no heart.\nHe who does so as an adult has no brain.","author":"J Moore"},{"quote":"Computer science is to biology what calculus is to physics.\nIt's the natural mathematical technique that best maps the character  of the subject.","author":"H. Morowitz"},{"quote":"A little inaccuracy sometimes saves tons of explanation.","author":"H.H. Munro"},{"quote":"You have to honor failure, because failure is just the negative space around success.","author":"R. Nelson (in Wired 06/2004 page 166)"},{"quote":"Computing is not about computers any more. It is about living.","author":"N. Negroponte"},{"quote":"Between 1892 say, and 1904, movies were made by the cameraman because he  understood the equipment.\nAnd that is exactly where we are now [in software design].\nIn 1904 they invented the director; what was the director?\nIt was the guy who didn't have to know how to load the camera didn't have to know how to sew costumes, play a violin, dance, fence, or hang the lights.\nBut, he had to know how to make those effects come together in a unified experience...\nWhy are video games so much better designed than office\nsoftware?\nVideogames are designed by people who love to play video games.\nOffice software is designed by people who want to do something else on the weekend...\nWhat does showbusiness teach you. It teaches you that  design is war; it is a power struggle between the producers, directors, authors, everyone who wants to be involved.","author":"T. Nelson (transcribed from a talk at Engelbart's Unfinished Revolution a Stanford University Symposium)"},{"quote":"In mathematics you don't understand things.\nYou just get used to them.","author":"J. von Neumann"},{"quote":"There is no reason anyone would want a computer in their home.","author":"K. Olsen (Founder and President, Digital Equipment Corporation), 1977"},{"quote":"The best performance improvement is the transition from the nonworking state to the working state","author":"J. Osterhout"},{"quote":"Complexity kills.\nIt sucks the life out of developers, it makes products difficult to plan, build and test, it introduces security challenges and it causes end-user and administrator frustration.\n...[we should] explore and embrace techniques to reduce complexity. ","author":"R. Ozzie"},{"quote":"As a rule, software systems do not work well until they have been used, and have failed repeatedly, in real applications.","author":"D. Parnas"},{"quote":"A programming language is like a natural, human language in that it favors certain methaphors, images, and ways of thinking.","author":"S. Papert (in \"Mindstorms: Children, Computers, and Powerfule Ideas\", 1980)"},{"quote":"My basic idea is that programming is the most powerful medium of developing the sophisticated and rigorous thinking needed for mathematics, for grammar, for physics, for statistics, for all the \"hard\" subjects....\nIn short, I believe more than ever that programming should be a key part of the intellectual development of people growing up.","author":"S. Papert (in \"CACM January 2005 (Vol 24, #1, pp38)\")"},{"quote":"I have made this letter longer than usual, only because I have not had the time to make it shorter.","author":"B. Pascal"},{"quote":"Chance favors the prepared mind.","author":"L. Pasteur"},{"quote":"A class, in Java, is where we teach objects how to behave.","author":"R. Pattis"},{"quote":"Code should run as fast as necessary, but no faster; something important is always traded away to increase speed.","author":"R. Pattis"},{"quote":"If you cannot grok the overall structure of a program while taking a shower [e.g., with no external memory aids], you are not ready to code it.","author":"R. Pattis"},{"quote":"The purpose of brakes on a car is to allow you to go fast.\nAlthough the gas pedal makes you go fast, the brake pedal allows you to drive safely while going fast.\nThe purpose of a strict compiler (one that performs type checking, uninitialized variable checking, reachability analysis, etc.) is to allow you to program fast.\nProgrammers -like all humans- have limited intellects: when they focus on one aspect of a program, they must ignore others.\nFocusing on the right aspect at the right time is critical.\nBy understanding those aspects that the compiler can check, you can ignore them, and focus on more important ones.\nSome programmers think that such an approach is reckless; they believe that you must pay close attention to everything at once.\nThey are right -for them; but I'm just not that smart, so I must use my tools more effectively.","author":"R. Pattis"},{"quote":"The structure of a software system provides the ecology in which code is born, matures, and dies.\nA well-designed habitat allows for the successful evolution of all the components needed in a software system.","author":"R. Pattis"},{"quote":"The three most important aspects of debugging and real estate are the same: Location, Location, and Location.","author":"R. Pattis"},{"quote":"There is a famous rule in performance optimization called the 90/10 rule: 90% of a program's execution time is spent in only 10% of its code.\nThe standard inference from this rule is that programmers should find that 10% of the code and optimize it, because that's the only code where improvements make a difference in the overall system performance.\nBut a second inference is just as important: programmers can deoptimize the other 90% of the code (in order to make it easier to use, maintain, etc.), because deterioration (of performance) of that code won't make much of a difference in the overall system performance.","author":"R. Pattis"},{"quote":"When debugging, novices insert corrective code; experts remove defective code.","author":"R. Pattis"},{"quote":"When teaching a rapidly changing technology, perspective is more important than content.","author":"R. Pattis"},{"quote":"When building a complex system, having crackerjack programmers (who can make any design work, even a bad one) can be a liability.\nThe result, after lots of effort, is a working system that cannot be easily maintained or upgraded.\nGood -but not great- programmers would fail early, causing a realization that the system must be redesigned, and then reimplemented.\nThe extra cost is paid once, early in the system's cycle (when it is cheap), instead of repeatedly paid late in the system's cycle (when it is more expensive).","author":"R. Pattis"},{"quote":"Don't tell people how to do things.\nTell them what to do and let them  surprise you with their results.","author":"G. Patton"},{"quote":"The best way to get a good idea is to get a lot of ideas.","author":"L. Pauling"},{"quote":"A good programming language is a conceptual universe for thinking about programming.","author":"A. Perlis"},{"quote":"A language that doesn't affect the way you think about programming is not worth knowing. ","author":"A. Perlis"},{"quote":"Any noun can be verbed.","author":"A. Perlis"},{"quote":"Fools ignore complexity; pragmatists suffer it; experts avoid it; geniuses remove it.\t","author":"A. Perlis"},{"quote":"I think it is inevitable that people program poorly.\nTraining will not substantially help matters.\nWe have to learn to live with it.","author":"A. Perlis"},{"quote":"It goes against the grain of modern education to teach students to program.\nWhat fun is there to making plans, acquiring discipline, organizing thoughts, devoting attention to detail, and learning to be self critical.","author":"A. Perlis"},{"quote":"It is easier to write an incorrect program than understand a correct one.","author":"A. Perlis"},{"quote":"Optimization hinders evolution.","author":"A. Perlis"},{"quote":"Simplicity does not precede complexity, but follows it.","author":"A. Perlis"},{"quote":"There are two ways to write error-free programs, but only the third one works.","author":"A. Perlis"},{"quote":"To understand a program, you must become both the machine and the program.","author":"A. Perlis"},{"quote":"You think you KNOW when you learn, are more sure when you can write, even more when you can teach, but certain when you can program.","author":"A. Perlis"},{"quote":"Computers are useless.  They only give you answers.","author":"P. Picasso"},{"quote":"I am always doing that which I cannot do, in order that I may learn how to do it.","author":"P. Picasso"},{"quote":"Fancy algorithms are slow when N is small, and N is usually small.","author":"R. Pike"},{"quote":"Fancy optimizers have fancy bugs.","author":"R. Pike"},{"quote":"Thinking and spoken discourse are the same thing, except that what we call thinking is, precisely, the inward dialogue carried on by the mind with itself without spoken sound.","author":"Plato"},{"quote":"The mind is not a vessel to be filled, but a fire to be ignited.","author":"Plutarch (See W.B. Yeats: Education...)"},{"quote":"Life is good only for two things: to study mathematics and to teach it.","author":"M. Poisson"},{"quote":"Computers in the future may weigh no more than 1.5 tons.","author":"Popular Science (1959)"},{"quote":"Knowledge of a subject means knowledge of the language of that subject, which includes not only what its words mean, but far more important, how its words mean.\nAs one learns the language of a subject, one is also learning what the subject is.\nIt cannot be said often enough that what we call a subject consists mostly, if not entirely, of its language. If you eliminate all the words of a subject, you have eliminated the subject.\nBiology is not plants and animals. It is language about plants and animals.\nHistory is not events.\nIt is language describing and interpreting events.\nAstronomy is not planets and stars. \nIt is a way of talking about planets and stars.","author":"N. Postman"},{"quote":"Gates has always understood Moore's Law better than anyone else in the industry.\nIf you can make something run at all, get it out there -it may be slow and clunky, but hardware improvements will bail you out.\nIf you wait until it's running perfectly on the hardware already in the field, it will be obsolete before it's released.\nThis philosophy built Microsoft and is the main reason Microsoft won the war IBM declared back in the OS/2 days.","author":"J. Pournelle (Dr. Dobbs Journal, Feb. 2004, pp. 89)"},{"quote":"The voyage of discovery is not in seeking new landscapes but in having new eyes.","author":"M. Proust"},{"quote":"Given enough eyeballs, all bugs are shallow (e.g., given a large enough beta-tester and co-developer base, almost every problem will be characterized quickly and the fix obvious to someone).\n(also see \"The honest truth...\" by B. Joy).\n","author":"E. Raymond (Lesson 8 in The Cathedral and the Bazaar)"},{"quote":"Good programmers know what to write.\nGreat ones know what to use.\n[I'd add: Exceptional programmers know how to write code that others can use. -REP]","author":"E. Raymond"},{"quote":"Ugly programs are like ugly suspension bridges: they're much more liable to collapse than pretty ones, because the way humans (especially engineer-humans) perceive beauty is intimately related to our ability to process and understand complexity.\nA language that makes it hard to write elegant code makes it hard to write good code.","author":"E. Raymond"},{"quote":"Computer Science is the first engineering discipline in which the complexity of the objects created is limited solely by the skill of  the creator, and not by the strength of raw materials.","author":"B. Reid"},{"quote":"All of us had been trained by Kelly Johnson [designer of the Lockheed SR-71] and believed fanatically in his insistence that an airplane that looked beautiful would fly the same way.","author":"B. Rich (in \"Skunk Works\")"},{"quote":"In time of profound change, the learners inherit the earth, while the learned find themselves beautifully equipped to deal with a world that no longer exists.","author":"A. Rogers"},{"quote":"God is in the details.","author":"M. van der Rohe"},{"quote":"Less is more.","author":"M. van der Rohe"},{"quote":"Software is abstract and therefore seems as if it should be infinitely malleable.\nAnd yet, for all its ethereal flexibility, it can be stubbornly, maddeneningly intractable, and it is constantly surprising us with his rigidity.","author":"S. Rosenberg (in \"Dreaming in Code\", pp 58)"},{"quote":"Don't you hate code that's not properly indented?\nMaking it [indenting] part of the syntax guarantees that all code is properly indented.","author":"G. van Rossum(designer of the Python)"},{"quote":"The highest reward for a person's toil is not what they get for it, but what they become by it.","author":"J. Ruskin"},{"quote":"Language serves not only to express thought but to make possible thoughts which could not exist without it.","author":"B. Russell"},{"quote":"A designer knows he's achieved perfection not when there is nothing left to add, but when there is nothing left to take away.","author":"A. de Saint-Exupery"},{"quote":"If you want to build a ship, don't drum up the men to gather wood, divide the work and give orders.\nInstead, teach them to yearn for the vast and endless sea. ","author":"A. de Saint-Exupery"},{"quote":"Questions are the important thing, answers are less important.\nLearning to ask a good question is the heart of intelligence.\nLearning the answer---well, answers are for students.\nQuestions are for thinkers.","author":"R. Schank (in \"The Connosseur's Guide to the Mind\")"},{"quote":"There is one very good reason to learn programming, but it has nothing to do with preparing for high-tech careers or with making sure one is computer literate in order to avoid being cynically manipulated by the computers of the future.\nThe real value of learning to program can only be understood if we look at learning to program as an exercise of the intellect, as a kind of modern-day Latin that we learn to sharpen our minds.","author":"R. Schank (in \"The Cognitive Computer)"},{"quote":"The skill of writing is to create a context in which other people can think.","author":"E. Schlossberg"},{"quote":"Machines are simple: a hammer, a door hinge, a steak knife.\nSystems are much more complicated; they have components, feedback loops, mean times between failure, infrastructure.\nDigital systems are daedal; even a simple computer program has hundreds of thousands of lines of computer code doing all sorts of different things.\nA complex computer program has thousands of components, each of which has to work by itself and in interaction with all the other components.\nThis is why object-oriented programming was developed: to deal with the complexity of digital systems...systems have bugs.\nA bug is a particular kind of failure...It's different from a malfunction.\nWhen something malfunctions, it no longer works properly.\nWhen something has a bug, it misbehaves in a particular way, possibly unrepeatable, and possibly unexplainable.\nBugs are unique to systems.\nMachines can break, or fail, or not work, but only a system can have a bug.","author":"B. Schneier (in Secrets & Lies: Digital Security in a Networked World)."},{"quote":"Microsoft knows that reliable software is not cost effective.\nAccording to studies, 90% to 95% of all bugs are harmless.\nThey're never discovered by users, and they don't affect performance.\nIt's much cheaper to release buggy software and fix the 5% to 10% of bugs people find and complain about.","author":"B. Schneier"},{"quote":"If the code and the comments disagree, then both are probably wrong.","author":"N. Schryer"},{"quote":"Always to see the general in the particular is the very foundation of genius.","author":"A. Schopenhauer"},{"quote":"Thus the task is not so much to see what no one has yet seen, but to think what no one has yet throught about that which everybody sees.","author":"E. Schrodinger"},{"quote":"Data is not information, \nInformation is not knowledge,\nKnowledge is not understanding,\nUnderstanding is not wisdom.","author":"Gary Schubert (extending Cliff Stoll in \"Silicon Snake Oil\")"},{"quote":"Any intelligent fool can make things bigger and more complex.\nIt takes a touch of genius -and a lot of courage- to move in the opposite direction","author":"E.F. Schumacher"},{"quote":"And simple truth miscalled simplicity,","author":"W. Shakespeare (Sonnet 66)"},{"quote":"Learning results from what the student does and thinks, and only from what the student does and thinks.\nThe teacher can advance learning only by influencing the student to learn.","author":"H. Simon"},{"quote":"Mathematics is a language.\nWe want scientists to be able to read it, speak it, and write it.\nBut we are are not training them to be grammarians.","author":"H. Simon"},{"quote":"I'd rather write programs to write programs than write programs.","author":"D. Sites"},{"quote":"I cannot teach anybody anything, I can only make them think.","author":"Socrates"},{"quote":"One must learn by doing the thing; for though you think you know it, you have no certainty, until you try.","author":"Sophocles"},{"quote":"Computers do not solve problems -computers carry out solutions, specified by people, to problems.","author":"D. D. Spencer"},{"quote":"EMACS could not have been reached by a process of careful design, because such processes arrive only at goals which are visible at the outset, and whose desirability is established on the bottom line at the outset.\nNeither I nor anyone else visualized an extensible editor until I had made one, nor appreciated its value until he had experienced it.\nEMACS exists because I felt free to make individually useful small improvements on a path whose end was not in sight.","author":"R. Stallman"},{"quote":"Giving the Linus Torvalds Award to the Free Software Foundation is a bit like giving the Han Solo Award to the Rebel Alliance.","author":"R. Stallman"},{"quote":"Being forced to write comments actually improves code, because it is easier to fix a crock than to explain it.","author":"G. Steele"},{"quote":"[teaching]is rather artificial.\nThe world is complicated and messy, with lots of loose ends, and the teacher's job is to impose order on the confusion, to convert a chaotic set of episodes into a coherent narrative.","author":"I. Stewart (in \"Letters to a Young Mathematician\")"},{"quote":"Don't get suckered in by the comments -they can be terribly misleading: Debug only the code.","author":"D. Storer"},{"quote":"Design and programming are human activities; forget that and all is lost.","author":"B. Stroustrup"},{"quote":"It is my firm belief that all successful languages are grown and not merely designed from first principles","author":"B. Stroustrup (in \"The Design and Evolution of C++\")"},{"quote":"More good code has been written in languages denounced as \"bad\" than in languages proclaimed \"wonderful\" -much more.","author":"B. Stroustrup (in The Design and Evolution of C++)"},{"quote":"The most important single aspect of software development is to be clear about what you are trying to build.","author":"B. Stroustrup"},{"quote":"There are only two kinds of programming languages: those people always bitch about and those nobody uses. ","author":"B. Stroustrup"},{"quote":"I have learned throughout my life as a composer chiefly through my mistakes and pursuits of false assumptions, not my exposure to founts of wisdom and knowledge.","author":"I. Stravinsky"},{"quote":"Omit needless words.\nVigorous writing is concise.\nA sentence should contain no unnecessary words, a paragraph no unnecessary sentences, for the same reason that a drawing should have no unnecessary lines and a machine no unnecessary parts. ","author":"W Strunk Jr (in The Elements of Style)"},{"quote":"Rewrite and revise.\nDo not be afraid to seize what you have and cut it to ribbons ...\nGood writing means good revising.","author":"W Strunk Jr (in The Elements of Style)"},{"quote":"In engineering, as in other creative arts, we must learn to do analysis to support our efforts in synthesis.\nOne cannot build a beautiful and functional bridge without a knowledge of steel and dirt, and a considerable mathematical technique for using  this knowledge to compute the properties of structures.\nSimilarly, one cannot build a beautiful computer system without a deep understanding of how to \"previsualize\" the process generated by the code one writes.","author":"G. Sussman"},{"quote":"It is a bad plan that admits of no modification.","author":"P. Syrus"},{"quote":"Once you succeed in writing the programs for [these] complicated algorithms, they usually run extremely fast.\nThe computer doesn't need to understand the algorithm, its task is only to run the programs.","author":"R. Tarjan"},{"quote":"The function of genius is not to give new answers, but to pose new questions which time and mediocrity can resolve.","author":"H. Trevor-Howard"},{"quote":"It is better to have an approximate answer to the right question than an exact answer to the wrong one.","author":"J. Tukey"},{"quote":"Unless in communicating with it [a computer] one says exactly what one means, trouble is bound to result.","author":"A. Turing"},{"quote":"We shall do a much better programming job, provided we approach the task with a full appreciation of its tremendous difficulty, provided that we respect the intrinsic limitations of the human mind and approach the task as very humble programmers.","author":"A. Turing"},{"quote":"He [John von Neumann] had the invaluable faculty of being able to take the most difficult problem and separate it into its components, whereupon everything looked brlliantly simple.","author":"S. Ulam (Bull. of American Mathematical Society, May 1958)"},{"quote":"It's easy to cry \"bug\" when the truth is that you've got a complex system and sometimes it takes a while to get all the components to co-exist peacefully.","author":"D. Vargas"},{"quote":"The outcome of any serious research can only be to make two questions grow where only one grew before.","author":"T. Veblen"},{"quote":"The best is the enemy of the good.","author":"Voltaire (\"Dramatic Art\" in _Philosophical Dictionary, 1764)"},{"quote":"Judge a man by his questions, rather than his answers.","author":"Voltaire"},{"quote":"The problem with using C++... is that there's already a strong tendancy in the language to require you to know everything before you can do anything.","author":"L. Wall"},{"quote":"The mediocre teacher tells.\nThe good teacher explains.\nThe superior teacher demonstrates.\nThe great teacher inspires.","author":"W. A. Ward"},{"quote":"I think there is a world market for maybe five computers.","author":"T. J. Watson (Founder and Chairman, IBM), 1943"},{"quote":"If you want to increase your success rate, double your failure rate.","author":"T. J. Watson"},{"quote":"The best writing is rewriting.","author":"E. B. White"},{"quote":"By relieving the brain of all unnecessary work, a good notation sets it free to concentrate on more advanced problems, and in effect increases the mental power of the race.","author":"A. N. Whitehead"},{"quote":"Newton was a genius, but not because of the superior computational power of his brain.\nNewton's genius was, on the contrary, his ability to simplify, idealize, and streamline the world so that it became, in some measure, tractable to the brains of perfectly ordinary men.","author":"G. M. Weinberg"},{"quote":"I have never learned anything except from people younger than myself.","author":"O. Wilde"},{"quote":"As soon as we started programming, we found out to our surprise that it wasn't as easy to get programs right as we had thought.\nDebugging had to be discovered.\nI can remember the exact instant when I realized that a large part of my life from then on was going to be spent in finding mistakes in my own programs.","author":"M. Wilkes"},{"quote":"Furious activity is no substitute for understanding.","author":"H. H. Williams"},{"quote":"From a programmer's point of view, the user is a peripheral that types when you issue a read request.","author":"P. Williams"},{"quote":"He knows the course forwards and backwards. He teaches it backwards ","author":"S. Willoughby (commenting on Garrett Birkhoff's freshman calculus course at Harvard\nin \"The Other End of the Log: Memoirs of an Education Rebel\")"},{"quote":"Complexity has and will maintain a strong fascination for many people.\nIt is true that we live in a complex world and strive to solve inherently complex problems, which often do require complex mechanisms.\nHowever, this should not diminish our desire for elegant solutions, which convince by their clarity and effectiveness.\nSimple, elegant solutions are more effective, but they are harder to find than complex ones, and they require more time, which we too often believe to be unaffordable","author":"N. Wirth"},{"quote":"Increasingly, people seem to misinterpret complexity as sophistication, which is baffling -the incomprehensible should cause suspicion rather than admiration.\nPossibly this trend results from a mistaken belief that using a somewhat mysterious device confers an aura of power on the user. ","author":"N. Wirth"},{"quote":"Software gets slower faster than hardware gets faster.\n(Or, sometimes known by] Grove [the head of Intel] giveth and Gates [the head of Microsoft]  taketh away.)","author":"N. Wirth"},{"quote":"Don't ask what it means, but rather how it is used.","author":"L. Wittgenstein"},{"quote":"If we spoke a different language, we would perceive a somewhat different world.","author":"L. Wittgenstein"},{"quote":"The limits of your language are the limits of your world.","author":"L. Wittgenstein"},{"quote":"More bugs have been introduced into programs through premature optimization than any other cause, including pure stupidity. (sometimes quoted as, \"More computing sins are committed in the name of efficiency (without necessarily achieving it) than for any other single reason -including blind stupidity.\")","author":"W. Wulf"},{"quote":"Education is not the filling of a pail, but the lighting of a fire.","author":"W.B. Yeats (See Plutarch: The mind...)"},{"quote":"Cutler, armed with a schedule [for finishing MS Windows NT], was urging the tream to \"eat its own dog food.\"\nPart macho stunt and part common sense, the \"dog food diet\" was the cornerstone of Cutler's philosophy.\n\"We're going to run on the program we build,\" he insisted.\nEating dog food meant there would be no escape from facing the flaws and imperfections of NT. \nEven while immersed in his own piece of NT, a code writer would confront all of its weaknesses.\nBy controlling the operations of a code writer's computer, NT would define the quality of his life.\nIf at first NT tasted no better than dog food, all the better.\nCode writers would feel an urgent need to raise the dietary level by quickly fixing the errant code and writing more durable code in the first place.","author":"G. P. Zachary (in \"Show-Stopper: The Breakneck Race to Create Windows NT and the Next Generation at Microsoft\")"},{"quote":"Technical skill is mastery of complexity, while creativity is mastery of simplicity.","author":"E. C. Zeeman"},{"quote":"One day Chao-Chou fell down in the snow, and called out: \"Help me! Help Me!\"\nA monk came and lay down beside him.\nChao-Chou got up and went away.","author":"Zen koan"},{"quote":"Who is wise? He who learns from all people...as it is said: \"From all my teachers I gained understanding\".","author":"B. Zoma (Psalms 119:99)"}]